In [2]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Aman", "Bhavna", "Chetan"],
    "age": [25, 30, 22],
    "city": ["Delhi", "Mumbai", "Pune"] 
})
df
print(df.info()) 
print(df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes
None
             age
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000

In [3]:
df["name"]              # single column
df[["name", "city"]]

     name    city
0    Aman   Delhi
1  Bhavna  Mumbai
2  Chetan    Pune

In [4]:
df["age_next_year"] = df["age"] + 1
df

     name  age    city  age_next_year
0    Aman   25   Delhi             26
1  Bhavna   30  Mumbai             31
2  Chetan   22    Pune             23

In [5]:
df2= pd.DataFrame({
    "name": ["A", "B", None, "D"],
    "age": [25,None,30,22]
})
print(df2.isnull().sum())
df2_filled = df2.fillna({
    "name": "Unknown",
    "age": df2['age'].mean()
})
df2_filled

name    1
age     1
dtype: int64

      name        age
0        A  25.000000
1        B  25.666667
2  Unknown  30.000000
3        D  22.000000

In [8]:
df_csv = pd.read_csv("../data/people.csv")
df_csv

     name  age       city
0    Aman   25      Delhi
1  Bhavna   30     Mumbai
2  Chetan   22       Pune
3   Divya   28  Bangalore

In [9]:
df_csv["city"].value_counts()

city
Delhi        1
Mumbai       1
Pune         1
Bangalore    1
Name: count, dtype: int64